Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОчередьБронирования</xr:Item>
				<xr:Item>InformationRegister.СтатусыОбъектовНедвижимости</xr:Item>
				<xr:Item>InformationRegister.СрокиБронированияОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗапрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСрокаБронирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииБронирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляСнятияБронирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомКлик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацииБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацииБронирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бронирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеБронирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Бронирование/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура СоздатьБронирование(Команда)
	ОткрытьФормуНовогоДокументаПоВидуОперации(ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.Бронирование"));	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСнятиеСБронирования(Команда)
	ОткрытьФормуНовогоДокументаПоВидуОперации(ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.СнятиеБронирования"));	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоДокументаПоВидуОперации(ВидОперации)

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
		
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ЗначенияЗаполнения.Вставить("ОснованиеДляСнятияБронирования", Элементы.Список.ТекущиеДанные.Ссылка);	
	КонецЕсли;
	
	Если ЭтотОбъект.ВладелецФормы <> Неопределено 
			И ЭтотОбъект.ВладелецФормы.ИмяФормы = "Документ.Запрос.Форма.ФормаДокумента" Тогда
		
		ЗначенияЗаполнения.Вставить("Клиент",			ЭтотОбъект.ВладелецФормы.Объект.Клиент); 
		ЗначенияЗаполнения.Вставить("ДокументЗапрос",	ЭтотОбъект.ВладелецФормы.Объект.Ссылка); 
		ЗначенияЗаполнения.Вставить("Проект",			ЭтотОбъект.ВладелецФормы.Объект.Проект);
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);	
	
	ОткрытьФорму("Документ.Бронирование.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры // ОткрытьФормуНовогоДокументаПоВидуОперации()

#КонецОбласти
